In [1]:
import pandas as pd
df = pd.read_csv("/Users/prateekprajapati/Documents/finPay_analytics_data/raw/transactions_large.csv")
df.head()

,transaction_id,user_id,merchant_id,amount,currency,payment_method,status,transaction_ts,category,country,device_type,is_promo_used
0,5000000,3620,2008,284.63,INR,google_pay,success,2024-10-29 15:21:42,Groceries,IN,Android,No
1,5000001,1131,2002,1555.06,INR,google_pay,success,2024-04-22 16:21:18,Entertainment,IN,Android,No
2,5000002,3414,2018,708.37,INR,google_pay,success,2024-06-21 03:43:16,Groceries,IN,Android,Yes
3,5000003,1380,2025,506.47,INR,card,success,2024-07-12 02:52:08,Food,IN,Android,No
4,5000004,3262,2019,134.81,INR,upi,failed,2024-05-28 02:54:18,Entertainment,IN,Android,No

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120000 entries, 0 to 119999
Data columns (total 12 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   transaction_id  120000 non-null  int64
 1   user_id         120000 non-null  int64
 2   merchant_id     120000 non-null  int64
 3   amount          120000 non-null  float64
 4   currency        120000 non-null  object
 5   payment_method  120000 non-null  object
 6   status          120000 non-null  object
 7   transaction_ts  120000 non-null  object
 8   category        120000 non-null  object
 9   country         120000 non-null  object
 10  device_type     120000 non-null  object
 11  is_promo_used   120000 non-null  object
dtypes: float64(1), int64(3), object(8)
memory usage: 11.0+ MB

In [3]:
df.describe(include='all')

,transaction_id,user_id,merchant_id,amount,currency,payment_method,status,transaction_ts,category,country,device_type,is_promo_used
count,1.200000e+05,120000.000000,120000.000000,120000.000000,120000,120000,120000,120000,120000,120000,120000,120000
unique,NaN,NaN,NaN,NaN,2,4,3,119751,6,2,2,2
top,NaN,NaN,NaN,NaN,INR,google_pay,success,2024-04-27 02:59:20,Food,IN,Android,No
freq,NaN,NaN,NaN,NaN,107826,59742,101959,2,20104,107872,95870,84038
mean,5.060000e+06,3000.678858,2025.532717,548.353289,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,3.464116e+04,1156.112337,14.412237,496.233350,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,5.000000e+06,1001.000000,2001.000000,50.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,5.030000e+06,1999.000000,2013.000000,193.387500,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,5.060000e+06,3004.000000,2026.000000,397.460000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,5.089999e+06,4005.000000,2038.000000,742.987500,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,5.119999e+06,5000.000000,2050.000000,5920.690000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [4]:
df['transaction_ts'] = pd.to_datetime(df['transaction_ts'])

In [5]:
df['date'] = df['transaction_ts'].dt.date
df['year'] = df['transaction_ts'].dt.year
df['month'] = df['transaction_ts'].dt.month
df['month_name'] = df['transaction_ts'].dt.month_name()
df['weekday'] = df['transaction_ts'].dt.day_name()
df['hour'] = df['transaction_ts'].dt.hour

In [6]:
df.head()

,transaction_id,user_id,merchant_id,amount,currency,payment_method,status,transaction_ts,category,country,device_type,is_promo_used,date,year,month,month_name,weekday,hour
0,5000000,3620,2008,284.63,INR,google_pay,success,2024-10-29 15:21:42,Groceries,IN,Android,No,2024-10-29,2024,10,October,Tuesday,15
1,5000001,1131,2002,1555.06,INR,google_pay,success,2024-04-22 16:21:18,Entertainment,IN,Android,No,2024-04-22,2024,4,April,Monday,16
2,5000002,3414,2018,708.37,INR,google_pay,success,2024-06-21 03:43:16,Groceries,IN,Android,Yes,2024-06-21,2024,6,June,Friday,3
3,5000003,1380,2025,506.47,INR,card,success,2024-07-12 02:52:08,Food,IN,Android,No,2024-07-12,2024,7,July,Friday,2
4,5000004,3262,2019,134.81,INR,upi,failed,2024-05-28 02:54:18,Entertainment,IN,Android,No,2024-05-28,2024,5,May,Tuesday,2

In [7]:
df['is_promo_used'] = df['is_promo_used'].map({'Yes': 1, 'No': 0})

In [27]:
df

,transaction_id,user_id,merchant_id,amount,currency,payment_method,status,transaction_ts,category,country,device_type,is_promo_used,date,year,month,month_name,weekday,hour
0,5000000,3620,2008,284.63,INR,google_pay,success,2024-10-29 15:21:42,Groceries,IN,Android,0,2024-10-29,2024,10,October,Tuesday,15
1,5000001,1131,2002,1555.06,INR,google_pay,success,2024-04-22 16:21:18,Entertainment,IN,Android,0,2024-04-22,2024,4,April,Monday,16
2,5000002,3414,2018,708.37,INR,google_pay,success,2024-06-21 03:43:16,Groceries,IN,Android,1,2024-06-21,2024,6,June,Friday,3
3,5000003,1380,2025,506.47,INR,card,success,2024-07-12 02:52:08,Food,IN,Android,0,2024-07-12,2024,7,July,Friday,2
4,5000004,3262,2019,134.81,INR,upi,failed,2024-05-28 02:54:18,Entertainment,IN,Android,0,2024-05-28,2024,5,May,Tuesday,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119995,5119995,4514,2049,50.75,INR,upi,failed,2024-08-17 20:48:30,Travel,US,Android,0,2024-08-17,2024,8,August,Saturday,20
119996,5119996,4489,2034,221.07,INR,upi,success,2024-03-18 17:31:43,Entertainment,IN,Android,1,2024-03-18,2024,3,March,Monday,17
119997,5119997,4974,2017,333.05,INR,upi,success,2024-07-27 09:14:23,Food,IN,Android,0,2024-07-27,2024,7,July,Saturday,9
119998,5119998,1433,2012,62.07,INR,upi,success,2024-10-17 14:20:51,Travel,US,Android,0,2024-10-17,2024,10,October,Thursday,14
119999,5119999,1254,2001,352.42,INR,card,success,2024-03-21 22:49:59,Travel,IN,Android,0,2024-03-21,2024,3,March,Thursday,22

In [21]:
dim_country=df[['country']].drop_duplicates().reset_index(drop=True)
dim_country['country_id']=dim_country.index+1
dim_country

  country  country_id
0      IN           1
1      US           2

In [22]:
dim_device=df[['device_type']].drop_duplicates().reset_index(drop=True)
dim_device['device_id']=dim_device.index+1
dim_device

  device_type  device_id
0     Android          1
1         iOS          2

In [23]:
dim_payment=df[['payment_method']].drop_duplicates().reset_index(drop=True)
dim_payment['payment_method_id']=dim_payment.index+1
dim_payment

  payment_method  payment_method_id
0     google_pay                  1
1           card                  2
2            upi                  3
3         wallet                  4

In [24]:
dim_user=df[['user_id']].drop_duplicates().reset_index(drop=True)
dim_user

      user_id
0        3620
1        1131
2        3414
3        1380
4        3262
...       ...
3995     2525
3996     3123
3997     2712
3998     4736
3999     3232

[4000 rows x 1 columns]

In [25]:
dim_merchant=df[['merchant_id', 'category']].drop_duplicates()
dim_merchant

      merchant_id       category
0            2008      Groceries
1            2002  Entertainment
2            2018      Groceries
3            2025           Food
4            2019  Entertainment
...           ...            ...
1530         2003         Retail
1582         2005          Bills
1676         2024         Retail
1839         2019           Food
1929         2040      Groceries

[300 rows x 2 columns]

In [26]:
dim_date=df[['date', 'year', 'month', 'month_name', 'weekday', 'hour']].drop_duplicates()
dim_date

             date  year  month month_name   weekday  hour
0      2024-10-29  2024     10    October   Tuesday    15
1      2024-04-22  2024      4      April    Monday    16
2      2024-06-21  2024      6       June    Friday     3
3      2024-07-12  2024      7       July    Friday     2
4      2024-05-28  2024      5        May   Tuesday     2
...           ...   ...    ...        ...       ...   ...
67694  2024-07-01  2024      7       July    Monday    14
67919  2024-08-03  2024      8     August  Saturday    19
69363  2024-06-07  2024      6       June    Friday     5
69633  2024-04-23  2024      4      April   Tuesday    18
71775  2024-01-30  2024      1    January   Tuesday     2

[8784 rows x 6 columns]

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120000 entries, 0 to 119999
Data columns (total 18 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   transaction_id  120000 non-null  int64
 1   user_id         120000 non-null  int64
 2   merchant_id     120000 non-null  int64
 3   amount          120000 non-null  float64
 4   currency        120000 non-null  object
 5   payment_method  120000 non-null  object
 6   status          120000 non-null  object
 7   transaction_ts  120000 non-null  datetime64[ns]
 8   category        120000 non-null  object
 9   country         120000 non-null  object
 10  device_type     120000 non-null  object
 11  is_promo_used   120000 non-null  int64
 12  date            120000 non-null  object
 13  year            120000 non-null  int32
 14  month           120000 non-null  int32
 15  month_name      120000 non-null  object
 16  weekday         120000 non-null  object
 17  hour            120000 non-null  int32
dtypes: datetime64[ns](1), float64(1), int32(3), int64(4), object(9)
memory usage: 15.1+ MB

In [15]:
fact=df.merge(dim_country, on='country', how='left')
fact=fact.merge(dim_device, on='device_type', how='left')
fact=fact.merge(dim_payment, on='payment_method', how='left')

In [16]:
dim_country

  country  country_id
0      IN           1
1      US           2

In [17]:
df

,transaction_id,user_id,merchant_id,amount,currency,payment_method,status,transaction_ts,category,country,device_type,is_promo_used,date,year,month,month_name,weekday,hour
0,5000000,3620,2008,284.63,INR,google_pay,success,2024-10-29 15:21:42,Groceries,IN,Android,0,2024-10-29,2024,10,October,Tuesday,15
1,5000001,1131,2002,1555.06,INR,google_pay,success,2024-04-22 16:21:18,Entertainment,IN,Android,0,2024-04-22,2024,4,April,Monday,16
2,5000002,3414,2018,708.37,INR,google_pay,success,2024-06-21 03:43:16,Groceries,IN,Android,1,2024-06-21,2024,6,June,Friday,3
3,5000003,1380,2025,506.47,INR,card,success,2024-07-12 02:52:08,Food,IN,Android,0,2024-07-12,2024,7,July,Friday,2
4,5000004,3262,2019,134.81,INR,upi,failed,2024-05-28 02:54:18,Entertainment,IN,Android,0,2024-05-28,2024,5,May,Tuesday,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119995,5119995,4514,2049,50.75,INR,upi,failed,2024-08-17 20:48:30,Travel,US,Android,0,2024-08-17,2024,8,August,Saturday,20
119996,5119996,4489,2034,221.07,INR,upi,success,2024-03-18 17:31:43,Entertainment,IN,Android,1,2024-03-18,2024,3,March,Monday,17
119997,5119997,4974,2017,333.05,INR,upi,success,2024-07-27 09:14:23,Food,IN,Android,0,2024-07-27,2024,7,July,Saturday,9
119998,5119998,1433,2012,62.07,INR,upi,success,2024-10-17 14:20:51,Travel,US,Android,0,2024-10-17,2024,10,October,Thursday,14
119999,5119999,1254,2001,352.42,INR,card,success,2024-03-21 22:49:59,Travel,IN,Android,0,2024-03-21,2024,3,March,Thursday,22

In [29]:
fact_transactions=fact[['transaction_id','user_id', 'merchant_id', 'country_id', 'device_id', 'payment_method_id','date', 'amount', 'status','is_promo_used']]

In [36]:
fact_transactions

,transaction_id,user_id,merchant_id,country_id,device_id,payment_method_id,date,amount,status,is_promo_used
0,5000000,3620,2008,1,1,1,2024-10-29,284.63,success,0
1,5000001,1131,2002,1,1,1,2024-04-22,1555.06,success,0
2,5000002,3414,2018,1,1,1,2024-06-21,708.37,success,1
3,5000003,1380,2025,1,1,2,2024-07-12,506.47,success,0
4,5000004,3262,2019,1,1,3,2024-05-28,134.81,failed,0
...,...,...,...,...,...,...,...,...,...,...
119995,5119995,4514,2049,2,1,3,2024-08-17,50.75,failed,0
119996,5119996,4489,2034,1,1,3,2024-03-18,221.07,success,1
119997,5119997,4974,2017,1,1,3,2024-07-27,333.05,success,0
119998,5119998,1433,2012,2,1,3,2024-10-17,62.07,success,0
119999,5119999,1254,2001,1,1,2,2024-03-21,352.42,success,0

In [39]:
dim_country.to_csv('dim_country.csv', index=False)
dim_device.to_csv('dim_device.csv', index=False)
dim_payment.to_csv('dim_payment.csv', index=False)
dim_user.to_csv('dim_user.csv', index=False)
dim_merchant.to_csv('dim_merchant.csv', index=False)
dim_date.to_csv('dim_date.csv', index=False)
fact_transactions.to_csv('fact_transactions.csv', index=False)